Revit 2027 API
FabricationPartRouteEnd.CreateFromConnector Method
 Create fabrication routing end from connector end point.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationPartRouteEnd CreateFromConnector(
	Connector connnector
)
Public Shared Function CreateFromConnector (
	connnector As Connector
) As FabricationPartRouteEnd
public:
static FabricationPartRouteEnd^ CreateFromConnector(
	Connector^ connnector
)
static member CreateFromConnector :
        connnector : Connector -> FabricationPartRouteEnd
Parameters
connnector Connector
 The connector that the route will connect to. The connector cannot have an existing connection.
Return Value
FabricationPartRouteEnd
Exceptions
Exception | Condition
ArgumentException |  Connector is connected.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace